In [1]:
3*3

9

In [4]:
import numpy as np
import pandas as pd

In [5]:
dictionary = {
    "name":["A","B","C"],
    "position":[1,2,3]
}

In [6]:
pd.DataFrame(dictionary)

  name  position
0    A         1
1    B         2
2    C         3

In [7]:
df = pd.DataFrame(dictionary)

In [8]:
df.to_csv('sampleTest.csv')

In [9]:
df.head(1);def.tail(1)

SyntaxError: invalid syntax (2321136974.py, line 1)

In [10]:
df.head(1)

  name  position
0    A         1

In [11]:
df.tail(1)

  name  position
2    C         3

In [12]:
df.describe()

       position
count       3.0
mean        2.0
std         1.0
min         1.0
25%         1.5
50%         2.0
75%         2.5
max         3.0

In [13]:
newDF = pd.read_csv('Newsample.csv')

In [14]:
newDF

  name  position  marks
0    A         1   24.5
1    B         2   21.0
2    C         3   34.0

In [15]:
newDF.describe()

       position      marks
count       3.0   3.000000
mean        2.0  26.500000
std         1.0   6.726812
min         1.0  21.000000
25%         1.5  22.750000
50%         2.0  24.500000
75%         2.5  29.250000
max         3.0  34.000000

In [16]:
 newDF['marks']

0    24.5
1    21.0
2    34.0
Name: marks, dtype: float64

In [17]:
newDF['marks'][0]

24.5

In [18]:
newDF['marks'][0] = 25

C:\Users\Admin\AppData\Local\Temp\ipykernel_22984\2852829092.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newDF['marks'][0] = 25

In [19]:
newDF

  name  position  marks
0    A         1   25.0
1    B         2   21.0
2    C         3   34.0

In [20]:
newDF.index

RangeIndex(start=0, stop=3, step=1)

In [21]:
pd.Series(np.random.rand)

0    <built-in method rand of numpy.random.mtrand.R...
dtype: object

In [22]:
pd.Series(np.random.rand(34))

0     0.752040
1     0.034396
2     0.642624
3     0.469579
4     0.325857
5     0.353305
6     0.942286
7     0.170320
8     0.242756
9     0.962211
10    0.480102
11    0.592237
12    0.938466
13    0.978259
14    0.244701
15    0.943942
16    0.262666
17    0.290559
18    0.669949
19    0.998086
20    0.744319
21    0.180231
22    0.180523
23    0.414871
24    0.645081
25    0.865970
26    0.816402
27    0.913528
28    0.319094
29    0.882945
30    0.953978
31    0.507341
32    0.772310
33    0.883619
dtype: float64

In [ ]:
series = pdf.Series(np.random.rand(34)) #create random values in range of 34